Revit 2024 API
BuiltInFailures.WallFailures.VerticalLayerExtensionFailureError Property
 Cannot extend layer(s) of the highlighted vertically compound wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId VerticalLayerExtensionFailureError { get; }
Visual Basic
Public Shared ReadOnly Property VerticalLayerExtensionFailureError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ VerticalLayerExtensionFailureError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace